<template>
    <div class="wrapper">
        <input type="text" value="SEO" disabled>
        <div class="result">
            <router-link to="/seo" class="result__title">SEO — заказать пакет поисковой оптимизаци…</router-link>
            <div class="result__text">Страница SEO рассказывает о поисковой оптимизации и поэтому выглядит, как выдача результатов в условном поиске. Здесь может идти подробный текст, объясняющий основные принципы, а само окно заказа может всплывать по клику на ссылку в новой вкладке.</div>
        </div>
        <div class="result">
            <router-link to="/contextus" class="result__title">Контекстная реклама</router-link>
            <div class="result__text">Следующая «выдача» может вести на страницы, которые пользовательеще не посещал, или наоборот, те, на которые его стоит направить исходя из релеванотности SEO. Это может быть как один пункт, так и целая лента со всеми пунктами меню услуг, по убыванию релевантности. Выпадающий список подсказок в поле поиска также служит меню.</div>
        </div>
        <div class="result">
            <router-link to="/price-lists" class="result__title">Таргетированная реклама</router-link>
            <div class="result__text">Страница SEO рассказывает о поисковой оптимизации и поэтому выглядит, как выдача результатов в условном поиске. Здесь может идти подробный текст, объясняющий основные принципы, а само окно заказа может всплывать по клику на ссылку в новой вкладке.</div>
        </div>
        <div class="result">
            <router-link to="/target" class="result__title">Реклама в социальных сетях</router-link>
            <div class="result__text">Следующая «выдача» может вести на страницы, которые пользовательеще не посещал, или наоборот, те, на которые его стоит направить исходя из релеванотности SEO. Это может быть как один пункт, так и целая лента со всеми пунктами меню услуг, по убыванию релевантности. Выпадающий список подсказок в поле поиска также служит меню.</div>
        </div>
        <div class="result">
            <router-link to="/cpa" class="result__title">CPA</router-link>
            <div class="result__text">Страница SEO рассказывает о поисковой оптимизации и поэтому выглядит, как выдача результатов в условном поиске. Здесь может идти подробный текст, объясняющий основные принципы, а само окно заказа может всплывать по клику на ссылку в новой вкладке.</div>
        </div>
        <div class="result">
            <router-link to="/analitycs" class="result__title">Веб аналитика</router-link>
            <div class="result__text">Следующая «выдача» может вести на страницы, которые пользовательеще не посещал, или наоборот, те, на которые его стоит направить исходя из релеванотности SEO. Это может быть как один пункт, так и целая лента со всеми пунктами меню услуг, по убыванию релевантности. Выпадающий список подсказок в поле поиска также служит меню.</div>
        </div>
        <div class="result">
            <router-link to="/media" class="result__title">Медийная реклама</router-link>
            <div class="result__text">Страница SEO рассказывает о поисковой оптимизации и поэтому выглядит, как выдача результатов в условном поиске. Здесь может идти подробный текст, объясняющий основные принципы, а само окно заказа может всплывать по клику на ссылку в новой вкладке.</div>
        </div>
        <div class="result">
            <router-link to="/mobilr-ads" class="result__title">Реклама на мобильных устройствах</router-link>
            <div class="result__text">Следующая «выдача» может вести на страницы, которые пользовательеще не посещал, или наоборот, те, на которые его стоит направить исходя из релеванотности SEO. Это может быть как один пункт, так и целая лента со всеми пунктами меню услуг, по убыванию релевантности. Выпадающий список подсказок в поле поиска также служит меню.</div>
        </div>
    </div>
</template>

<script>
export default {
  name: 'SEO'
}
</script>

<style lang="sass" scoped>
    .wrapper
        width: 52%
        align-self: center
        padding-bottom: 5rem

    input
        border: 0
        outline: 0
        width: 100%
        height: 5rem
        background: #fff
        font-size: 2.1rem
        padding-left: 2rem
        box-shadow: 0 0 1.5rem .3rem rgba(28,0,0,.2)

    .result
        margin-top: 5rem
        padding: 0 1rem 0 2rem

        &__title
            color: #2649db
            font-size: 1.8rem

        &__text
            line-height: 1.4
            margin-top: 2rem
            font-size: 1.5rem
</style>
