[
  {
    "id": 1,
    "title": "Менеджер по контекстной рекламе",
    "text": "<strong>Мы постоянно в поиске</strong> менеджеров по контекстной рекламе разного уровня, опыта и стажа.<br><br><strong>Очень важно</strong>: понимать, что в работе с клиентом важнее всего - это результат, быть готовым брать на себя ответственность за него и прилагать все возможные и невозможные усилия для его достижения, уметь находить нетривиальные решения, быть постоянно в курсе постоянно меняющихся тенденций интернет-маркетинга.<br><br><strong>Важно</strong>: уметь самостоятельно вести проекты в Яндекс.Директ и Google Adwords, уметь получать и анализировать данные при помощи Google.Analytics и Яндекс.Метрика, понимать, что такое СРА, CPO, CPL, CR, ДРР, ROI, ROAS и т.д., не бояться работать с Excel/PowerPoint/Spreadsheets.<br><br>Если вы не совпадаете по какому-либо из пунктов, но очень хотите это исправить - все равно пишите",
    "tags": [1, 2]
  },
  {
    "id": 2,
    "title": "Руководитель проекта",
    "text": "Данная позиция предполагает:<ul class=\"one-job__demands\"><li class=\"one-job__demand\">стратегическое управление ключевыми проектами агентства</li><li class=\"one-job__demand\">понимание специфики различных каналов performance маркетинга</li><li class=\"one-job__demand\">управление командой, сроками, качеством и аналитикой проекта</li><li class=\"one-job__demand\">постоянное общение с клиентом</li><li class=\"one-job__demand\">высокий уровень экспертизы, ответственности и самостоятельности</li></ul><strong>Важно</strong>: системы Google Analytics/Яндекс Метрика, системы Яндекс.Директ/Google Adwords, показатели CPC, CPO, CPA, ROI, понимание принципов работы таргетированной рекламы/Programmatic/иных каналов, аналитические и презентационные навыки, готовность решать проблемы.",
    "tags": [1, 3]
  },
  {
    "id": 3,
    "title": "Аккаунт-менеджер в SEO",
    "text": "<strong>Важно</strong>: понимание приемов поисковой оптимизации и основ разработки сайтов, владение инструментами Google Analytics/Яндекс Метрики, уверенные коммуникативные навыки (включая деловую переписку) и желание расти в области управления проектами.<br><br>Данная позиция не предполагает техническое ведение кампаний - необходимо будет общаться с одним из ключевых клиентов компании, максимально погружаться в KPI его бизнеса, контролировать все рабочие процессы по проекту внутри своей команды и с командой клиента, и не забывать про аналитику.",
    "tags": [1, 5]
  },
  {
    "id": 4,
    "title": "Аккаунт-менеджер в области таргетированной рекламы",
    "text": "Данная позиция предполагает: ведение ключевых клиентов, контроль показателей рекламных кампаний, KPI и работы внутренней команды по клиенту/внешних подрядчиков.<br><br><strong>Важно</strong>:<ul class=\"one-job__demands\"><li class=\"one-job__demand\">иметь опыт работы с аналогичными задачами в области таргетированной/мобильной рекламы,</li><li class=\"one-job__demand\">иметь опыт работы с Google Analytics/Яндекс Метрикой,</li><li class=\"one-job__demand\">уметь работать в условиях многозадачности,</li><li class=\"one-job__demand\">уметь ставить задачи и контролировать ход их выполнения</li></ul>",
    "tags": [1, 4]
  },
  {
    "id": 5,
    "title": "Junior manager",
    "text": "Мы готовы рассматривать специалистов без опыта работы, но с огромным желанием расти в области digital, если у них есть:<ul class=\"one-job__demands\"><li class=\"one-job__demand\">уверенные теоретические знания в области контекстной рекламы или иных каналов в интернет-маркетинге</li><li class=\"one-job__demand\">знания Excel (сводные таблицы, функции, формулы, фильтры)</li><li class=\"one-job__demand\">устная/письменная грамотность</li><li class=\"one-job__demand\">возможность работать полный рабочий день</li></ul>Мы готовы обучать всем необходимым практическим навыкам ведения контекстной рекламы/интернет-проектов",
    "tags": [7]
  }
]